In [370]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [211]:
s = pd.Series([1,3,5,np.nan,6,8])

In [212]:
s

0     1
1     3
2     5
3   NaN
4     6
5     8
dtype: float64

In [213]:
s1 = pd.Series([1,3,5])
s1

0    1
1    3
2    5
dtype: int64

In [214]:
s2 = pd.Series([1.1,3,5])

In [215]:
s2

0    1.1
1    3.0
2    5.0
dtype: float64

In [216]:
dates = pd.date_range('20150915', periods=6)
dates

DatetimeIndex(['2015-09-15', '2015-09-16', '2015-09-17', '2015-09-18',
               '2015-09-19', '2015-09-20'],
              dtype='datetime64[ns]', freq='D', tz=None)

In [217]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2015-09-15 -1.941117 -1.690357 -0.897567  1.315112
2015-09-16  1.582244 -1.072284  0.213478  0.683469
2015-09-17 -0.090915 -1.067342  1.431283 -0.072642
2015-09-18 -1.535915  1.711669 -0.451760  0.890223
2015-09-19  0.364546 -0.324148 -1.088555  0.024754
2015-09-20 -0.311710  0.719982  0.074906 -0.223547

In [218]:
df1 = pd.DataFrame(np.random.randn(4,6), index=list('ABCD'), columns=dates)
df1

   2015-09-15  2015-09-16  2015-09-17  2015-09-18  2015-09-19  2015-09-20
A    1.255570   -0.885467    0.372502    0.881112   -1.517410    0.102497
B   -2.544595   -0.776391   -0.252551   -0.451302    0.207067   -0.347142
C   -0.552157    0.247360   -0.971193   -1.113465    0.968211   -0.244130
D    0.571130   -1.086357   -1.539564    1.281458   -0.663440    0.219387

In [219]:
df2 = pd.DataFrame({ 'A' : 1.,
                     'B' : pd.Timestamp('20150915'),
                     'C' : pd.Series(1, index=list(range(4)),dtype='float32'),
                     'D' : np.array([3] * 4, dtype='int32'),
                     'E' : pd.Categorical(["test", "train", "test", "train"]),
                     'F' : 'foo' })

In [220]:
df2

   A          B  C  D      E    F
0  1 2015-09-15  1  3   test  foo
1  1 2015-09-15  1  3  train  foo
2  1 2015-09-15  1  3   test  foo
3  1 2015-09-15  1  3  train  foo

In [221]:
df3 = pd.DataFrame({ 'A' : list([1,2,3,4]),
                     'B' : pd.Timestamp('20150915'),
                     'C' : pd.Series(1, index=list(range(4)),dtype='float32'),
                     'D' : np.array([3] * 4, dtype='int32'),
                     'E' : pd.Categorical(["test", "train", "test", "train"]),
                     'F' : 'foo' })

In [222]:
df3

   A          B  C  D      E    F
0  1 2015-09-15  1  3   test  foo
1  2 2015-09-15  1  3  train  foo
2  3 2015-09-15  1  3   test  foo
3  4 2015-09-15  1  3  train  foo

In [223]:
df3 = pd.DataFrame({ 'A' : list([1,2,3,4]),
                     'B' : pd.date_range('20150915', periods=4),
                     'C' : pd.Series(1, index=list(range(4)),dtype='float32'),
                     'D' : np.array([3] * 4, dtype='int32'),
                     'E' : pd.Categorical(["test", "train", "test", "train"]),
                     'F' : 'foo' })

In [224]:
df3

   A          B  C  D      E    F
0  1 2015-09-15  1  3   test  foo
1  2 2015-09-16  1  3  train  foo
2  3 2015-09-17  1  3   test  foo
3  4 2015-09-18  1  3  train  foo

In [225]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [226]:
df2.<TAB>

SyntaxError: invalid syntax (<ipython-input-226-e8d0e54abc86>, line 1)

In [227]:
df.head()

                   A         B         C         D
2015-09-15 -1.941117 -1.690357 -0.897567  1.315112
2015-09-16  1.582244 -1.072284  0.213478  0.683469
2015-09-17 -0.090915 -1.067342  1.431283 -0.072642
2015-09-18 -1.535915  1.711669 -0.451760  0.890223
2015-09-19  0.364546 -0.324148 -1.088555  0.024754

In [228]:
df.tail(3)

                   A         B         C         D
2015-09-18 -1.535915  1.711669 -0.451760  0.890223
2015-09-19  0.364546 -0.324148 -1.088555  0.024754
2015-09-20 -0.311710  0.719982  0.074906 -0.223547

In [229]:
df.tail(2)

                   A         B         C         D
2015-09-19  0.364546 -0.324148 -1.088555  0.024754
2015-09-20 -0.311710  0.719982  0.074906 -0.223547

In [230]:
df.head(3)

                   A         B         C         D
2015-09-15 -1.941117 -1.690357 -0.897567  1.315112
2015-09-16  1.582244 -1.072284  0.213478  0.683469
2015-09-17 -0.090915 -1.067342  1.431283 -0.072642

In [231]:
df.head(7)

                   A         B         C         D
2015-09-15 -1.941117 -1.690357 -0.897567  1.315112
2015-09-16  1.582244 -1.072284  0.213478  0.683469
2015-09-17 -0.090915 -1.067342  1.431283 -0.072642
2015-09-18 -1.535915  1.711669 -0.451760  0.890223
2015-09-19  0.364546 -0.324148 -1.088555  0.024754
2015-09-20 -0.311710  0.719982  0.074906 -0.223547

In [232]:
df.tail()

                   A         B         C         D
2015-09-16  1.582244 -1.072284  0.213478  0.683469
2015-09-17 -0.090915 -1.067342  1.431283 -0.072642
2015-09-18 -1.535915  1.711669 -0.451760  0.890223
2015-09-19  0.364546 -0.324148 -1.088555  0.024754
2015-09-20 -0.311710  0.719982  0.074906 -0.223547

In [233]:
df.index

DatetimeIndex(['2015-09-15', '2015-09-16', '2015-09-17', '2015-09-18',
               '2015-09-19', '2015-09-20'],
              dtype='datetime64[ns]', freq='D', tz=None)

In [234]:
df.columns

Index([u'A', u'B', u'C', u'D'], dtype='object')

In [235]:
df.values

array([[-1.94111668, -1.69035707, -0.89756741,  1.31511189],
       [ 1.58224351, -1.07228436,  0.21347847,  0.68346893],
       [-0.09091458, -1.06734197,  1.43128265, -0.07264161],
       [-1.53591502,  1.71166943, -0.4517603 ,  0.89022309],
       [ 0.36454571, -0.32414824, -1.08855529,  0.02475355],
       [-0.31170957,  0.71998153,  0.07490645, -0.22354696]])

In [236]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.322144 -0.287080 -0.119703  0.436228
std    1.284221  1.281022  0.917437  0.616967
min   -1.941117 -1.690357 -1.088555 -0.223547
25%   -1.229864 -1.071049 -0.786116 -0.048293
50%   -0.201312 -0.695745 -0.188427  0.354111
75%    0.250681  0.458949  0.178835  0.838535
max    1.582244  1.711669  1.431283  1.315112

In [237]:
df2.describe()

       A  C  D
count  4  4  4
mean   1  1  3
std    0  0  0
min    1  1  3
25%    1  1  3
50%    1  1  3
75%    1  1  3
max    1  1  3

In [238]:
df.T

   2015-09-15  2015-09-16  2015-09-17  2015-09-18  2015-09-19  2015-09-20
A   -1.941117    1.582244   -0.090915   -1.535915    0.364546   -0.311710
B   -1.690357   -1.072284   -1.067342    1.711669   -0.324148    0.719982
C   -0.897567    0.213478    1.431283   -0.451760   -1.088555    0.074906
D    1.315112    0.683469   -0.072642    0.890223    0.024754   -0.223547

In [239]:
df2.T

,0,1,2,3
A,1,1,1,1
B,2015-09-15 00:00:00,2015-09-15 00:00:00,2015-09-15 00:00:00,2015-09-15 00:00:00
C,1,1,1,1
D,3,3,3,3
E,test,train,test,train
F,foo,foo,foo,foo

In [240]:
df1.T

                   A         B         C         D
2015-09-15  1.255570 -2.544595 -0.552157  0.571130
2015-09-16 -0.885467 -0.776391  0.247360 -1.086357
2015-09-17  0.372502 -0.252551 -0.971193 -1.539564
2015-09-18  0.881112 -0.451302 -1.113465  1.281458
2015-09-19 -1.517410  0.207067  0.968211 -0.663440
2015-09-20  0.102497 -0.347142 -0.244130  0.219387

In [241]:
df1

   2015-09-15  2015-09-16  2015-09-17  2015-09-18  2015-09-19  2015-09-20
A    1.255570   -0.885467    0.372502    0.881112   -1.517410    0.102497
B   -2.544595   -0.776391   -0.252551   -0.451302    0.207067   -0.347142
C   -0.552157    0.247360   -0.971193   -1.113465    0.968211   -0.244130
D    0.571130   -1.086357   -1.539564    1.281458   -0.663440    0.219387

In [242]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2015-09-15  1.315112 -0.897567 -1.690357 -1.941117
2015-09-16  0.683469  0.213478 -1.072284  1.582244
2015-09-17 -0.072642  1.431283 -1.067342 -0.090915
2015-09-18  0.890223 -0.451760  1.711669 -1.535915
2015-09-19  0.024754 -1.088555 -0.324148  0.364546
2015-09-20 -0.223547  0.074906  0.719982 -0.311710

In [243]:
df.sort_index(axis=1, ascending=True)

                   A         B         C         D
2015-09-15 -1.941117 -1.690357 -0.897567  1.315112
2015-09-16  1.582244 -1.072284  0.213478  0.683469
2015-09-17 -0.090915 -1.067342  1.431283 -0.072642
2015-09-18 -1.535915  1.711669 -0.451760  0.890223
2015-09-19  0.364546 -0.324148 -1.088555  0.024754
2015-09-20 -0.311710  0.719982  0.074906 -0.223547

In [244]:
df.sort_index(axis=0, ascending=False)

                   A         B         C         D
2015-09-20 -0.311710  0.719982  0.074906 -0.223547
2015-09-19  0.364546 -0.324148 -1.088555  0.024754
2015-09-18 -1.535915  1.711669 -0.451760  0.890223
2015-09-17 -0.090915 -1.067342  1.431283 -0.072642
2015-09-16  1.582244 -1.072284  0.213478  0.683469
2015-09-15 -1.941117 -1.690357 -0.897567  1.315112

In [245]:
df.sort_index(axis=0, ascending=True)

                   A         B         C         D
2015-09-15 -1.941117 -1.690357 -0.897567  1.315112
2015-09-16  1.582244 -1.072284  0.213478  0.683469
2015-09-17 -0.090915 -1.067342  1.431283 -0.072642
2015-09-18 -1.535915  1.711669 -0.451760  0.890223
2015-09-19  0.364546 -0.324148 -1.088555  0.024754
2015-09-20 -0.311710  0.719982  0.074906 -0.223547

In [246]:
df.sort(columns='B')

                   A         B         C         D
2015-09-15 -1.941117 -1.690357 -0.897567  1.315112
2015-09-16  1.582244 -1.072284  0.213478  0.683469
2015-09-17 -0.090915 -1.067342  1.431283 -0.072642
2015-09-19  0.364546 -0.324148 -1.088555  0.024754
2015-09-20 -0.311710  0.719982  0.074906 -0.223547
2015-09-18 -1.535915  1.711669 -0.451760  0.890223

In [247]:
df['A']

2015-09-15   -1.941117
2015-09-16    1.582244
2015-09-17   -0.090915
2015-09-18   -1.535915
2015-09-19    0.364546
2015-09-20   -0.311710
Freq: D, Name: A, dtype: float64

In [248]:
df.A

2015-09-15   -1.941117
2015-09-16    1.582244
2015-09-17   -0.090915
2015-09-18   -1.535915
2015-09-19    0.364546
2015-09-20   -0.311710
Freq: D, Name: A, dtype: float64

In [249]:
df[0:3]

                   A         B         C         D
2015-09-15 -1.941117 -1.690357 -0.897567  1.315112
2015-09-16  1.582244 -1.072284  0.213478  0.683469
2015-09-17 -0.090915 -1.067342  1.431283 -0.072642

In [250]:
df['20150915','20150920']

KeyError: ('20150915', '20150920')

In [251]:
df['20150915':'20150919']

                   A         B         C         D
2015-09-15 -1.941117 -1.690357 -0.897567  1.315112
2015-09-16  1.582244 -1.072284  0.213478  0.683469
2015-09-17 -0.090915 -1.067342  1.431283 -0.072642
2015-09-18 -1.535915  1.711669 -0.451760  0.890223
2015-09-19  0.364546 -0.324148 -1.088555  0.024754

In [252]:
df.loc[dates[0]]

A   -1.941117
B   -1.690357
C   -0.897567
D    1.315112
Name: 2015-09-15 00:00:00, dtype: float64

In [253]:
df.loc[dates[4]]

A    0.364546
B   -0.324148
C   -1.088555
D    0.024754
Name: 2015-09-19 00:00:00, dtype: float64

In [254]:
df.loc[:,['A','B']]

                   A         B
2015-09-15 -1.941117 -1.690357
2015-09-16  1.582244 -1.072284
2015-09-17 -0.090915 -1.067342
2015-09-18 -1.535915  1.711669
2015-09-19  0.364546 -0.324148
2015-09-20 -0.311710  0.719982

In [255]:
df.loc['20150916':'20150919',['A','B']]

                   A         B
2015-09-16  1.582244 -1.072284
2015-09-17 -0.090915 -1.067342
2015-09-18 -1.535915  1.711669
2015-09-19  0.364546 -0.324148

In [256]:
df.loc['20150916',['A','B']]

A    1.582244
B   -1.072284
Name: 2015-09-16 00:00:00, dtype: float64

In [257]:
df.loc[dates[0],'A']

-1.9411166832871152

In [258]:
df.at[dates[0],'A']

-1.9411166832871152

In [259]:
df.iloc[3]

A   -1.535915
B    1.711669
C   -0.451760
D    0.890223
Name: 2015-09-18 00:00:00, dtype: float64

In [260]:
df

                   A         B         C         D
2015-09-15 -1.941117 -1.690357 -0.897567  1.315112
2015-09-16  1.582244 -1.072284  0.213478  0.683469
2015-09-17 -0.090915 -1.067342  1.431283 -0.072642
2015-09-18 -1.535915  1.711669 -0.451760  0.890223
2015-09-19  0.364546 -0.324148 -1.088555  0.024754
2015-09-20 -0.311710  0.719982  0.074906 -0.223547

In [261]:
df.iloc[0]

A   -1.941117
B   -1.690357
C   -0.897567
D    1.315112
Name: 2015-09-15 00:00:00, dtype: float64

In [262]:
df.iloc[3:5,0:2]

                   A         B
2015-09-18 -1.535915  1.711669
2015-09-19  0.364546 -0.324148

In [263]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2015-09-16  1.582244  0.213478
2015-09-17 -0.090915  1.431283
2015-09-19  0.364546 -1.088555

In [264]:
df.iloc[1:3,:]

                   A         B         C         D
2015-09-16  1.582244 -1.072284  0.213478  0.683469
2015-09-17 -0.090915 -1.067342  1.431283 -0.072642

In [265]:
df.iloc[:,1:3]

                   B         C
2015-09-15 -1.690357 -0.897567
2015-09-16 -1.072284  0.213478
2015-09-17 -1.067342  1.431283
2015-09-18  1.711669 -0.451760
2015-09-19 -0.324148 -1.088555
2015-09-20  0.719982  0.074906

In [266]:
df.iloc[1,1]

-1.0722843599801715

In [267]:
df.iat[1,1]

-1.0722843599801715

In [268]:
df[df.A > 0]

                   A         B         C         D
2015-09-16  1.582244 -1.072284  0.213478  0.683469
2015-09-19  0.364546 -0.324148 -1.088555  0.024754

In [269]:
df[df.D > 0]

                   A         B         C         D
2015-09-15 -1.941117 -1.690357 -0.897567  1.315112
2015-09-16  1.582244 -1.072284  0.213478  0.683469
2015-09-18 -1.535915  1.711669 -0.451760  0.890223
2015-09-19  0.364546 -0.324148 -1.088555  0.024754

In [270]:
df[df > 0]

                   A         B         C         D
2015-09-15       NaN       NaN       NaN  1.315112
2015-09-16  1.582244       NaN  0.213478  0.683469
2015-09-17       NaN       NaN  1.431283       NaN
2015-09-18       NaN  1.711669       NaN  0.890223
2015-09-19  0.364546       NaN       NaN  0.024754
2015-09-20       NaN  0.719982  0.074906       NaN

In [271]:
df2 = df.copy()

In [272]:
df2['E'] = ['one', 'one','two','three','four','three']

In [273]:
df2

                   A         B         C         D      E
2015-09-15 -1.941117 -1.690357 -0.897567  1.315112    one
2015-09-16  1.582244 -1.072284  0.213478  0.683469    one
2015-09-17 -0.090915 -1.067342  1.431283 -0.072642    two
2015-09-18 -1.535915  1.711669 -0.451760  0.890223  three
2015-09-19  0.364546 -0.324148 -1.088555  0.024754   four
2015-09-20 -0.311710  0.719982  0.074906 -0.223547  three

In [274]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2015-09-17 -0.090915 -1.067342  1.431283 -0.072642   two
2015-09-19  0.364546 -0.324148 -1.088555  0.024754  four

In [275]:
df2[df2['E'].isin(['one'])]

                   A         B         C         D    E
2015-09-15 -1.941117 -1.690357 -0.897567  1.315112  one
2015-09-16  1.582244 -1.072284  0.213478  0.683469  one

In [276]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20150916', periods=6))

In [277]:
s1

2015-09-16    1
2015-09-17    2
2015-09-18    3
2015-09-19    4
2015-09-20    5
2015-09-21    6
Freq: D, dtype: int64

In [278]:
df['F'] = s1
df

                   A         B         C         D   F
2015-09-15 -1.941117 -1.690357 -0.897567  1.315112 NaN
2015-09-16  1.582244 -1.072284  0.213478  0.683469   1
2015-09-17 -0.090915 -1.067342  1.431283 -0.072642   2
2015-09-18 -1.535915  1.711669 -0.451760  0.890223   3
2015-09-19  0.364546 -0.324148 -1.088555  0.024754   4
2015-09-20 -0.311710  0.719982  0.074906 -0.223547   5

In [279]:
df.at[dates[0],'A'] = 0
df.iat[0,1] = 0
df.loc[:,'D'] = np.array([5] * len(df))

In [280]:
df

                   A         B         C  D   F
2015-09-15  0.000000  0.000000 -0.897567  5 NaN
2015-09-16  1.582244 -1.072284  0.213478  5   1
2015-09-17 -0.090915 -1.067342  1.431283  5   2
2015-09-18 -1.535915  1.711669 -0.451760  5   3
2015-09-19  0.364546 -0.324148 -1.088555  5   4
2015-09-20 -0.311710  0.719982  0.074906  5   5

In [281]:
df.at[dates[1],'A'] = -1
df.iat[2,2] = 0.5

In [282]:
df

                   A         B         C  D   F
2015-09-15  0.000000  0.000000 -0.897567  5 NaN
2015-09-16 -1.000000 -1.072284  0.213478  5   1
2015-09-17 -0.090915 -1.067342  0.500000  5   2
2015-09-18 -1.535915  1.711669 -0.451760  5   3
2015-09-19  0.364546 -0.324148 -1.088555  5   4
2015-09-20 -0.311710  0.719982  0.074906  5   5

In [283]:
df2 = df.copy()

In [284]:
df2[df2 > 0] = -df2
df2

                   A         B         C  D   F
2015-09-15  0.000000  0.000000 -0.897567 -5 NaN
2015-09-16 -1.000000 -1.072284 -0.213478 -5  -1
2015-09-17 -0.090915 -1.067342 -0.500000 -5  -2
2015-09-18 -1.535915 -1.711669 -0.451760 -5  -3
2015-09-19 -0.364546 -0.324148 -1.088555 -5  -4
2015-09-20 -0.311710 -0.719982 -0.074906 -5  -5

In [285]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [286]:
df1

                   A         B         C  D   F   E
2015-09-15  0.000000  0.000000 -0.897567  5 NaN NaN
2015-09-16 -1.000000 -1.072284  0.213478  5   1 NaN
2015-09-17 -0.090915 -1.067342  0.500000  5   2 NaN
2015-09-18 -1.535915  1.711669 -0.451760  5   3 NaN

In [287]:
df1.loc[dates[0]:dates[1],'E'] = 1

In [288]:
df1

                   A         B         C  D   F   E
2015-09-15  0.000000  0.000000 -0.897567  5 NaN   1
2015-09-16 -1.000000 -1.072284  0.213478  5   1   1
2015-09-17 -0.090915 -1.067342  0.500000  5   2 NaN
2015-09-18 -1.535915  1.711669 -0.451760  5   3 NaN

In [289]:
df1.loc[dates[2], ['A','B']] = 2

In [290]:
df1

                   A         B         C  D   F   E
2015-09-15  0.000000  0.000000 -0.897567  5 NaN   1
2015-09-16 -1.000000 -1.072284  0.213478  5   1   1
2015-09-17  2.000000  2.000000  0.500000  5   2 NaN
2015-09-18 -1.535915  1.711669 -0.451760  5   3 NaN

In [291]:
df1.loc[dates[3], ['A':'C']] = 3

SyntaxError: invalid syntax (<ipython-input-291-91530a2b35fe>, line 1)

In [292]:
df1.dropna(how='any')

            A         B         C  D  F  E
2015-09-16 -1 -1.072284  0.213478  5  1  1

In [293]:
df1.fillna(value=10)

                   A         B         C  D   F   E
2015-09-15  0.000000  0.000000 -0.897567  5  10   1
2015-09-16 -1.000000 -1.072284  0.213478  5   1   1
2015-09-17  2.000000  2.000000  0.500000  5   2  10
2015-09-18 -1.535915  1.711669 -0.451760  5   3  10

In [294]:
pd.isnull(df1)

                A      B      C      D      F      E
2015-09-15  False  False  False  False   True  False
2015-09-16  False  False  False  False  False  False
2015-09-17  False  False  False  False  False   True
2015-09-18  False  False  False  False  False   True

In [295]:
df.mean()

A   -0.428999
B   -0.005354
C   -0.274916
D    5.000000
F    3.000000
dtype: float64

In [296]:
df.mean(1)

2015-09-15    1.025608
2015-09-16    0.828239
2015-09-17    1.268349
2015-09-18    1.544799
2015-09-19    1.590368
2015-09-20    2.096636
Freq: D, dtype: float64

In [297]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)
s

2015-09-15   NaN
2015-09-16   NaN
2015-09-17     1
2015-09-18     3
2015-09-19     5
2015-09-20   NaN
Freq: D, dtype: float64

In [298]:
df.sub(s, axis='index')

                   A         B         C   D   F
2015-09-15       NaN       NaN       NaN NaN NaN
2015-09-16       NaN       NaN       NaN NaN NaN
2015-09-17 -1.090915 -2.067342 -0.500000   4   1
2015-09-18 -4.535915 -1.288331 -3.451760   2   0
2015-09-19 -4.635454 -5.324148 -6.088555   0  -1
2015-09-20       NaN       NaN       NaN NaN NaN

In [299]:
df

                   A         B         C  D   F
2015-09-15  0.000000  0.000000 -0.897567  5 NaN
2015-09-16 -1.000000 -1.072284  0.213478  5   1
2015-09-17 -0.090915 -1.067342  0.500000  5   2
2015-09-18 -1.535915  1.711669 -0.451760  5   3
2015-09-19  0.364546 -0.324148 -1.088555  5   4
2015-09-20 -0.311710  0.719982  0.074906  5   5

In [300]:
df.apply(np.cumsum)

                   A         B         C   D   F
2015-09-15  0.000000  0.000000 -0.897567   5 NaN
2015-09-16 -1.000000 -1.072284 -0.684089  10   1
2015-09-17 -1.090915 -2.139626 -0.184089  15   3
2015-09-18 -2.626830 -0.427957 -0.635849  20   6
2015-09-19 -2.262284 -0.752105 -1.724405  25  10
2015-09-20 -2.573993 -0.032124 -1.649498  30  15

In [301]:
df.apply(lambda x: x.max() - x.min())

A    1.900461
B    2.783954
C    1.588555
D    0.000000
F    4.000000
dtype: float64

In [302]:
s = pd.Series(np.random.randint(0,7, size=10))

In [303]:
s

0    4
1    3
2    5
3    5
4    3
5    2
6    2
7    5
8    1
9    0
dtype: int32

In [304]:
s.value_counts()

5    3
3    2
2    2
4    1
1    1
0    1
dtype: int64

In [305]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])

In [306]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [307]:
s.str.upper()

0       A
1       B
2       C
3    AABA
4    BACA
5     NaN
6    CABA
7     DOG
8     CAT
dtype: object

In [308]:
s.str.len()

0     1
1     1
2     1
3     4
4     4
5   NaN
6     4
7     3
8     3
dtype: float64

In [309]:
# Merge_concat
df = pd.DataFrame(np.random.randn(10,4))

In [310]:
df

          0         1         2         3
0 -1.050911 -0.641705 -0.214893  0.036786
1 -0.549467 -1.528869 -0.509879  0.527614
2  0.819834 -0.797109 -0.503590 -0.492392
3  0.233757 -2.044251 -0.235870 -0.540655
4 -0.808214 -0.619442  1.009699 -0.696673
5 -0.600513  0.605443 -1.030071 -0.284900
6  1.776546  0.372839  0.043538 -0.519994
7  0.702797 -0.459961  0.440608 -1.017126
8  0.205805 -0.842487 -1.749333  0.432987
9 -1.670465 -1.684333 -0.293860 -0.209076

In [311]:
pieces = [df[:3], df[3:7], df[7:]]
pieces

[          0         1         2         3
 0 -1.050911 -0.641705 -0.214893  0.036786
 1 -0.549467 -1.528869 -0.509879  0.527614
 2  0.819834 -0.797109 -0.503590 -0.492392,
           0         1         2         3
 3  0.233757 -2.044251 -0.235870 -0.540655
 4 -0.808214 -0.619442  1.009699 -0.696673
 5 -0.600513  0.605443 -1.030071 -0.284900
 6  1.776546  0.372839  0.043538 -0.519994,
           0         1         2         3
 7  0.702797 -0.459961  0.440608 -1.017126
 8  0.205805 -0.842487 -1.749333  0.432987
 9 -1.670465 -1.684333 -0.293860 -0.209076]

In [312]:
pd.concat(pieces)

          0         1         2         3
0 -1.050911 -0.641705 -0.214893  0.036786
1 -0.549467 -1.528869 -0.509879  0.527614
2  0.819834 -0.797109 -0.503590 -0.492392
3  0.233757 -2.044251 -0.235870 -0.540655
4 -0.808214 -0.619442  1.009699 -0.696673
5 -0.600513  0.605443 -1.030071 -0.284900
6  1.776546  0.372839  0.043538 -0.519994
7  0.702797 -0.459961  0.440608 -1.017126
8  0.205805 -0.842487 -1.749333  0.432987
9 -1.670465 -1.684333 -0.293860 -0.209076

In [313]:
#Merge_join
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})

In [314]:
left

   key  lval
0  foo     1
1  foo     2

In [315]:
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})
right

   key  rval
0  foo     4
1  foo     5

In [316]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [317]:
pd.merge(right, left, on='key')

   key  rval  lval
0  foo     4     1
1  foo     4     2
2  foo     5     1
3  foo     5     2

In [318]:
right = pd.DataFrame({'rval': [4, 5], 'key': ['foo', 'foo']})

In [319]:
right

   key  rval
0  foo     4
1  foo     5

In [320]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [321]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                   'B': ['B0', 'B1', 'B2', 'B3']})
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'C': ['C0', 'C1', 'C2', 'C3'],
                   'D': ['D0', 'D1', 'D2', 'D3']})
result = pd.merge(left, right, on='key')

In [322]:
result

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

In [323]:
#Merge_append
df = pd.DataFrame(np.random.randn(8,4), columns=['A','B','C','D'])
df

          A         B         C         D
0  0.629883 -0.222144 -1.368394  1.690525
1  0.104926 -0.164703  0.207453 -0.695280
2 -0.673512  0.769132 -1.260610  1.511280
3 -2.021349  0.539063 -2.286188 -1.154186
4 -2.343273 -1.654105  0.762728  0.264141
5  0.113818  0.631594 -0.136349  0.629486
6  0.404147  1.024127  2.385979  0.027200
7 -1.592987  0.196074 -2.856422 -0.248671

In [324]:
s = df.iloc[3]

In [325]:
s

A   -2.021349
B    0.539063
C   -2.286188
D   -1.154186
Name: 3, dtype: float64

In [326]:
df.append(s, ignore_index=True)

          A         B         C         D
0  0.629883 -0.222144 -1.368394  1.690525
1  0.104926 -0.164703  0.207453 -0.695280
2 -0.673512  0.769132 -1.260610  1.511280
3 -2.021349  0.539063 -2.286188 -1.154186
4 -2.343273 -1.654105  0.762728  0.264141
5  0.113818  0.631594 -0.136349  0.629486
6  0.404147  1.024127  2.385979  0.027200
7 -1.592987  0.196074 -2.856422 -0.248671
8 -2.021349  0.539063 -2.286188 -1.154186

In [327]:
#Grouping
df= pd.DataFrame({'A': ['foo', 'bar', 'foo','bar',
                        'foo', 'bar', 'foo', 'foo'],
                  'B': ['one', 'one', 'two', 'three',
                        'two', 'two', 'one', 'three'],
                  'C': np.random.randn(8),
                  'D': np.random.randn(8)})
df

     A      B         C         D
0  foo    one  1.237090  0.447055
1  bar    one  0.658086 -0.731108
2  foo    two  0.277695 -0.846053
3  bar  three  1.336006 -2.254276
4  foo    two  0.206287 -0.104008
5  bar    two -1.361844  0.311143
6  foo    one  0.070842 -0.315263
7  foo  three -0.683595  0.247806

In [328]:
df.groupby('A').sum()

            C         D
A
bar  0.632249 -2.674241
foo  1.108319 -0.570462

In [329]:
df.groupby(['A', 'B']).sum()

                  C         D
A   B
bar one    0.658086 -0.731108
    three  1.336006 -2.254276
    two   -1.361844  0.311143
foo one    1.307932  0.131792
    three -0.683595  0.247806
    two    0.483982 -0.950060

In [330]:
df.groupby('A').mean()

            C         D
A
bar  0.210750 -0.891414
foo  0.221664 -0.114092

In [331]:
#Reshaping_stack
tuples = list(zip(*[['bar','bar','baz','baz',
                     'foo','foo','qux','qux'],
                   ['one', 'two', 'one', 'two',
                   'one', 'two', 'one', 'two']]))
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
df = pd.DataFrame(np.random.randn(8,2), index=index, columns = ['A','B'])

In [332]:
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [333]:
index

MultiIndex(levels=[[u'bar', u'baz', u'foo', u'qux'], [u'one', u'two']],
           labels=[[0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 0, 1, 0, 1, 0, 1]],
           names=[u'first', u'second'])

In [334]:
df

                     A         B
first second
bar   one     0.046738 -1.173204
      two    -1.139980 -0.446443
baz   one    -0.185515  2.714590
      two    -1.271815 -0.319318
foo   one     0.402064  0.480206
      two    -0.779104  0.153994
qux   one    -0.169837  0.775780
      two    -0.611703  0.636301

In [335]:
df2 = df[:4]

In [336]:
df2

                     A         B
first second
bar   one     0.046738 -1.173204
      two    -1.139980 -0.446443
baz   one    -0.185515  2.714590
      two    -1.271815 -0.319318

In [337]:
stacked = df2.stack()

In [338]:
stacked

first  second
bar    one     A    0.046738
               B   -1.173204
       two     A   -1.139980
               B   -0.446443
baz    one     A   -0.185515
               B    2.714590
       two     A   -1.271815
               B   -0.319318
dtype: float64

In [339]:
stacked.unstack()

                     A         B
first second
bar   one     0.046738 -1.173204
      two    -1.139980 -0.446443
baz   one    -0.185515  2.714590
      two    -1.271815 -0.319318

In [340]:
stacked.unstack(1)

second        one       two
first
bar   A  0.046738 -1.139980
      B -1.173204 -0.446443
baz   A -0.185515 -1.271815
      B  2.714590 -0.319318

In [341]:
stacked.unstack(0)

first          bar       baz
second
one    A  0.046738 -0.185515
       B -1.173204  2.714590
two    A -1.139980 -1.271815
       B -0.446443 -0.319318

In [342]:
stacked.unstack(2)

                     A         B
first second
bar   one     0.046738 -1.173204
      two    -1.139980 -0.446443
baz   one    -0.185515  2.714590
      two    -1.271815 -0.319318

In [343]:
#Reshaping_pivot tables
df = pd.DataFrame({'A' : ['one', 'one', 'two', 'three'] * 3,
                   'B' : ['A', 'B', 'C'] * 4,
                   'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                   'D' : np.random.randn(12),
                   'E' : np.random.randn(12)})
df

        A  B    C         D         E
0     one  A  foo  2.682228 -1.072727
1     one  B  foo -0.262310  1.196711
2     two  C  foo  1.501170 -0.592638
3   three  A  bar  1.001983 -0.282692
4     one  B  bar -0.265385 -0.670120
5     one  C  bar  0.450028  0.870164
6     two  A  foo  1.988219  0.972309
7   three  B  foo  1.453246 -1.574567
8     one  C  foo  1.417605  0.223083
9     one  A  bar -0.285945  0.048202
10    two  B  bar -0.633102 -0.672689
11  three  C  bar -0.339500  0.332951

In [344]:
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   A -0.285945  2.682228
      B -0.265385 -0.262310
      C  0.450028  1.417605
three A  1.001983       NaN
      B       NaN  1.453246
      C -0.339500       NaN
two   A       NaN  1.988219
      B -0.633102       NaN
      C       NaN  1.501170

In [345]:
pd.pivot_table(df, values='D', index=['C'], columns=['A'])

A         one     three       two
C
bar -0.033767  0.331242 -0.633102
foo  1.279175  1.453246  1.744694

In [346]:
#Time Series
rng = pd.date_range('1/1/2012', periods=100, freq='S')
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)
ts.resample('5Min', how='sum')

2012-01-01    23922
Freq: 5T, dtype: int32

In [347]:
rng = pd.date_range('3/6/2012 00:00', periods=5, freq='D')
ts = pd.Series(np.random.randn(len(rng)), rng)
ts

2012-03-06    1.406609
2012-03-07    0.238630
2012-03-08   -0.163219
2012-03-09   -0.504103
2012-03-10   -1.120128
Freq: D, dtype: float64

In [348]:
ts_utc = ts.tz_localize('UTC')
ts_utc

2012-03-06 00:00:00+00:00    1.406609
2012-03-07 00:00:00+00:00    0.238630
2012-03-08 00:00:00+00:00   -0.163219
2012-03-09 00:00:00+00:00   -0.504103
2012-03-10 00:00:00+00:00   -1.120128
Freq: D, dtype: float64

In [349]:
ts_utc.tz_convert('US/Eastern')

2012-03-05 19:00:00-05:00    1.406609
2012-03-06 19:00:00-05:00    0.238630
2012-03-07 19:00:00-05:00   -0.163219
2012-03-08 19:00:00-05:00   -0.504103
2012-03-09 19:00:00-05:00   -1.120128
Freq: D, dtype: float64

In [350]:
rng = pd.date_range('1/1/2012', periods=5, freq='M')

In [351]:
ts = pd.Series(np.random.randn(len(rng)), index=rng)

In [352]:
ts

2012-01-31   -0.067692
2012-02-29   -1.629203
2012-03-31   -0.713318
2012-04-30    2.493353
2012-05-31   -0.647779
Freq: M, dtype: float64

In [353]:
ps = ts.to_period()
ps

2012-01   -0.067692
2012-02   -1.629203
2012-03   -0.713318
2012-04    2.493353
2012-05   -0.647779
Freq: M, dtype: float64

In [354]:
ps.to_timestamp()

2012-01-01   -0.067692
2012-02-01   -1.629203
2012-03-01   -0.713318
2012-04-01    2.493353
2012-05-01   -0.647779
Freq: MS, dtype: float64

In [355]:
prng = pd.period_range('1990Q1', '2000Q4', freq='Q-NOV')

In [356]:
ts = pd.Series(np.random.randn(len(prng)), prng)
ts.index = (prng.asfreq('M', 'e') + 1).asfreq('H', 's') + 9
ts.head()

1990-03-01 09:00   -0.384426
1990-06-01 09:00    0.624019
1990-09-01 09:00    0.694877
1990-12-01 09:00   -0.520448
1991-03-01 09:00    0.590543
Freq: H, dtype: float64

In [357]:
#Categoricals
df = pd.DataFrame({"id":[1,2,3,4,5,6], "raw_grade":['a', 'b', 'b', 'a', 'a', 'e']})
df

   id raw_grade
0   1         a
1   2         b
2   3         b
3   4         a
4   5         a
5   6         e

In [358]:
df["grade"] = df["raw_grade"].astype("category")
df["grade"]

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): [a, b, e]

In [359]:
df["grade"].cat.categories = ["very good", "good", "very bad"]

In [360]:
df["grade"] = df["grade"].cat.set_categories(["very bad", "bad", "medium", "good", "very good"])

In [361]:
df["grade"]

0    very good
1         good
2         good
3    very good
4    very good
5     very bad
Name: grade, dtype: category
Categories (5, object): [very bad, bad, medium, good, very good]

In [362]:
df.sort("grade")

   id raw_grade      grade
5   6         e   very bad
1   2         b       good
2   3         b       good
0   1         a  very good
3   4         a  very good
4   5         a  very good

In [363]:
df

   id raw_grade      grade
0   1         a  very good
1   2         b       good
2   3         b       good
3   4         a  very good
4   5         a  very good
5   6         e   very bad

In [364]:
df.groupby("grade").size()

grade
very bad      1
bad         NaN
medium      NaN
good          2
very good     3
dtype: float64

In [365]:
#Plotting
ts = pd.Series(np.random.randn(1000), index=pd.date_range('1/1/2000', periods=1000))
ts = ts.cumsum()
ts.plot()

In [366]:
df = pd.DataFrame(np.random.randn(1000, 4), index=ts.index,
                  columns=['A', 'B', 'C', 'D'])
df = df.cumsum()
plt.figure(); df.plot(); plt.legend(loc='best')

In [367]:
#Getting Data In/Out_CSV
df.to_csv('foo.csv')

In [368]:
pd.read_csv('foo.csv')

     Unnamed: 0          A          B          C          D
0    2000-01-01   0.460659   0.797252  -3.051101  -0.503567
1    2000-01-02   0.317689   2.451500  -2.387362  -0.837150
2    2000-01-03  -0.798610   2.203599  -2.298249  -0.158353
3    2000-01-04  -0.351324   0.760248  -1.568777  -0.666596
4    2000-01-05  -0.710966   0.974182  -2.210974  -2.253767
5    2000-01-06  -1.324458   0.334780  -2.876166  -2.349226
6    2000-01-07  -0.006835   0.631266  -4.166870  -3.035170
7    2000-01-08   0.239719   0.369824  -3.532328  -4.572539
8    2000-01-09  -0.851402  -0.695508  -2.432295  -4.968621
9    2000-01-10  -0.151683   0.649221  -3.628152  -4.566578
10   2000-01-11   0.168968   1.402039  -3.894600  -4.301288
11   2000-01-12  -0.197082   1.120815  -4.359085  -3.718473
12   2000-01-13  -1.333151  -0.197815  -3.692341  -1.872704
13   2000-01-14  -0.085387  -2.098367  -5.049071  -2.260000
14   2000-01-15   0.938379  -1.860257  -5.308739  -1.126033
15   2000-01-16   1.143969  -2.209000  -3.931734  -0.186793
16   2000-01-17   0.874770  -2.833620  -4.440308  -0.943353
17   2000-01-18   1.772842  -4.872569  -5.582417  -1.499651
18   2000-01-19   1.734613  -2.778080  -5.283338  -2.551431
19   2000-01-20   2.042345  -1.889536  -4.435827  -3.167789
20   2000-01-21   2.324028  -3.033902  -5.078628  -3.242278
21   2000-01-22   2.799945  -2.491919  -4.445039  -2.803611
22   2000-01-23   2.210726  -1.016912  -5.892033  -4.123711
23   2000-01-24   0.722762   0.053376  -6.785638  -4.179208
24   2000-01-25   0.012066   0.806442  -7.283150  -2.969446
25   2000-01-26  -0.734005   1.211539  -8.812144  -2.708186
26   2000-01-27  -0.935156   0.622857  -8.844682  -2.746208
27   2000-01-28   0.023750  -1.557185  -8.535570  -2.213762
28   2000-01-29  -0.184961   0.818002 -10.209829  -2.135349
29   2000-01-30  -0.360627   1.980501 -10.198100  -1.548653
..          ...        ...        ...        ...        ...
970  2002-08-28  20.518318  37.934863  36.626877 -12.333657
971  2002-08-29  20.168790  35.046078  34.616293 -12.457342
972  2002-08-30  19.358179  35.538976  34.935715 -12.929020
973  2002-08-31  19.545776  34.339423  34.932037 -12.824991
974  2002-09-01  19.786728  34.314586  35.047492 -13.083171
975  2002-09-02  18.608575  35.060216  35.455537 -13.129296
976  2002-09-03  19.903761  35.566609  35.671440 -13.851244
977  2002-09-04  18.960194  34.581094  35.672371 -13.928255
978  2002-09-05  18.070785  32.320270  36.981778 -13.378507
979  2002-09-06  19.153846  31.080314  38.421058 -12.873361
980  2002-09-07  18.930397  30.748987  38.114526 -13.264626
981  2002-09-08  18.997167  30.002006  39.614947 -13.562905
982  2002-09-09  16.829124  30.546070  38.098956 -12.228569
983  2002-09-10  15.405776  30.839679  38.848394 -11.661029
984  2002-09-11  13.747513  32.449751  37.124372 -12.135693
985  2002-09-12  12.497499  32.543366  37.417277 -10.449337
986  2002-09-13  11.599873  31.290714  35.641563 -12.221829
987  2002-09-14  10.372610  29.113591  35.764600 -13.118131
988  2002-09-15   9.451913  27.814203  36.400063 -14.015404
989  2002-09-16   8.128336  25.367937  35.676593 -13.755866
990  2002-09-17  10.064524  25.229674  34.978954 -13.466370
991  2002-09-18   9.706427  25.880249  35.765467 -12.634246
992  2002-09-19   8.456795  27.752684  35.215816 -11.372334
993  2002-09-20   8.809410  26.528109  35.813334 -11.853922
994  2002-09-21   8.023414  25.041237  34.192955 -10.629432
995  2002-09-22   7.896066  23.763689  33.491194 -11.429235
996  2002-09-23   8.611612  25.479001  34.004381 -10.785367
997  2002-09-24   7.863136  26.538763  33.447683 -11.722009
998  2002-09-25   5.119089  26.394203  34.649942 -12.395039
999  2002-09-26   6.335465  27.046812  36.052150 -12.188917

[1000 rows x 5 columns]